using System;
using System.Collections.Generic;
using System.Linq;

namespace LINQ.InformationOnCriminals
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Database criminalBase = new Database();
            criminalBase.Work();
        }
    }

    class Database
    {
        private List<Client> _clients = new List<Client>();
        public Database()
        {
            Random random = new Random();
            int numberName;
            int numberSurname;
            int numberDisease;
            int counClient = 15;
            int maxAge = 100;
            int minAge = 1;
            int age;

            List<string> names = new List<string>()
            {
                "Александр",
                "Михаил",
                "Даниил",
                "Матвей",
                "Иван",
                "Кирилл",
                "Егор",
                "Дмитрий",
                "Роман",
                "Артем",
                "Тимофей",
                "Виктор",
                "Владимир",
                "Илья",
                "Максим",
                "Алексей",
                "Евгений",
                "Денис",
                "Ярослав",
                "Арсений",
                "Платон",
                "Никита",
                "Сергей",
                "Лев",
                "Степан",
                "Константин",
                "Мирон",
                "Богдан",
                "Федор",
                "Андрей",

            };

            List<string> surnames = new List<string>()
            {
                "Иванов",
                "Васильев",
                "Петров",
                "Смирнов",
                "Михайлов",
                "Фёдоров",
                "Соколов",
                "Яковлев",
                "Попов",
                "Андреев",
                "Алексеев",
                "Александров",
                "Лебедев",
                "Григорьев",
                "Степанов",
            };

            List<string> disease = new List<string>()
            {
                "Абсцесс головного мозга",
                "Абсцесс легкого хронический",
                "Абсцесс околочелюстной",
                "Авитаминоз",
                "Аденовирус",
                "Аденоиды (гипертрофия глоточной миндалины)",
                "Аденома простаты",
                "Аденома щитовидной железы",
                "Аденоматоз толстой кишки",
                "Аднексит (сальпингоофорит)",
                "Акне",
                "Акромегалия",
                "Актиномикоз",
                "Алалия",
                "Алкоголизм",
                "Аллергический ринит (насморк)",
                "Аллергия инсектная",
                "Аллергия лекарственная",
                "Аллергия пищевая",
                "Алопеция",
                "Альвеолит",
                "Альгоменорея",
                "Амблиопия",
                "Амебиаз (амебная дизентерия)",
                "Аменорея",
                "Амнезия",
                "Ангина",
                "Аневризмы сосудов головного мозга/интракраниальные аневризмы",
                "Аноргазмия",
                "Апатия",
                "Апноэ",
                "Аппендицит острый",
                "Аритмия",
                "Артроз",
                "Астенопия",
                "Астигматизм",
                "Атерома",
                "Атеросклероз",
                "Атопический дерматит",
                "Атопический дерматоз (нейродермит)",
                "Атрофия головного мозга",
                "Аутизм",
                "Афазия",
                "Базалиома",
                "Базедова болезнь",
                "Баланит",
                "Баротравма легкого",
                "Бартолинит",
                "Бедренная грыжа",
                "Белая горячка",
                "Бесплодие (ЭКО)",
                "Бессонница (инсомния)",
                "Бешенство",
                "Бластомикоз",
                "Блефарит",
                "Близорукость (миопия)",
                "Болезнь Аддисона",
                "Болезнь Альцгеймера",
                "Болезнь Боуэна",
                "Болезнь Бюргера (Облитерирующий тромбангиит)",
                "Болезнь Виллебранда",
                "Болезнь Гоше",
                "Болезнь Гюнтера",
                "Болезнь Иценко-Кушинга",
                "Болезнь кошачьих царапин (гранулема Молларе, лихорадка кошачьих царапин, лимфоретикулез)",
                "Болезнь Меньера",
                "Болезнь Паркинсона",
                "Болезнь Пейрони",
                "Болезнь Пертеса (остеохондропатия)",
                "Болезнь Пика",
                "Болезнь Уиппла",
                "Болезнь Хантингтона",
                "Болезнь Шляттера",
                "Бородавки",
                "Ботулизм",
                "Брадикардия",
                "Бронхиальная астма",
                "Бронхиолит",
                "Бронхит",
                "Бруксизм",
                "Бруцеллез",
                "Брюшной тиф",
                "Бурсит",
                "Вагинит (кольпит)",
                "Вазомоторный ринит",
                "Варикоз",
                "Варикоцеле",
                "Васкулит",
                "Вегето-сосудистая дистония",
                "Везикулит",
                "Венозная недостаточность",
                "Вертебро-базилярная недостаточность",
                "Ветряная оспа (Ветрянка)",
                "Вирильный синдром",
                "Вирус папилломы человека",
                "Вирус Эпштейна-Барра",
                "Витилиго",
                "ВИЧ-инфекция",
                "Внутренняя грыжа",
                "Водяная мозоль",
                "Водянка яичка (Гидроцеле)",
                "Волчанка",
                "Волчья пасть",
                "Вросший ноготь",
                "Вторичный сифилис",
                "Вульвит",
                "Вульвовагинит",
                "Вывих",
                "Выкидыш",
                "Выпадение прямой кишки",
                "Гайморит",
                "Галактоземия",
                "Галакторея",
                "Гастринома (синдром Золлингера-Эллисона)",
                "Гастрит",
                "Гастрит атрофический",
                "Гельминтоз",
                "Гемангиома",
                "Гематома",
                "Гематоцеле",
                "Гемианопсия",
                "Гемобластоз",
                "Геморрагический васкулит",
                "Геморрой",
                "Гемофилия",
                "Гемохроматоз",
                "Генерализованный гингвит",
                "Гепатит D",
                "Гепатит E",
                "Гепатит А (болезнь Боткина)",
                "Гепатит алкогольный",
                "Гепатит В",
                "Гепатит С",
                "Гепатобластома",
                "Герпес",
                "Гестоз",
                "Гигантизм",
                "Гигрома",
                "Гидраденит",
                "Гидроцефалия",
                "Гиперактивный мочевой пузырь",
                "Гипергидроз",
                "Гиперкератоз",
                "Гиперпаратиреоз",
                "Гиперплазия эндометрия",
                "Гиперпролактинемия",
                "Гиперсаливация",
                "Гиперсомния",
                "Гипертиреоз",
                "Гипертоническая болезнь (Гипертония, гипертензия)",
                "Гипертонический криз",
                "Гипогликемия",
                "Гипогонадизм",
                "Гипокальциемия",
                "Гипопаратиреоз",
                "Гипотензия (гипотония, обморок)",
                "Гипотиреоз",
                "Гирсутизм",
                "Глаукома",
                "Глисты (аскаридоз, энтеробиоз)",
                "Гломерулонефрит",
                "Глоссит",
                "Гонорея",
                "Грибковые заболевания",
                "Грипп",
                "Грыжа дифрагмального отверстия пищевода",
                "Дакриоцистит",
                "Дальнозоркость",
                "Дальтонизм",
                "ДВС-синдром",
                "Деменция",
                "Демодекоз",
                "Депрессия",
                "Дерматит",
                "Дерматит пеленочный",
                "Дерматит периоральный",
                "Дерматофития",
                "Детский церебральный паралич (ДЦП)",
                "Диабетическая нейропатия",
                "Диабетическая ретинопатия",
                "Диабетическая стопа",
                "Диарея",
                "Диатез",
                "Дивертикулез толстой кишки",
                "Дизентерия",
                "Диплопия",
                "Дисбактериоз",
                "Дисгидроз (помфоликс)",
                "Дислексия",
                "Диспепсия",
                "Дисплазия суставов",
                "Дисплазия тазобедренного сустава",
                "Дисплазия шейки матки",
                "Дистрофия сетчатки",
                "Дисфункция яичников",
                "Дифтерия",
                "Дуоденит",
                "Дыхательная недосточность",
                "Жар",
                "Железодефицитная анемия",
                "Желтуха",
                "Желудочковая тахикардия",
                "Желудочно-кишечное кровотечение",
                "Желчная киста",
                "Желчнокаменная болезнь",
                "Женский псевдогермафродитизм",
                "Жировой гепатоз",
                "Жировой некроз молочной железы",
                "Заворот века",
                "Заворот кишок",
                "Заглоточный абсцесс",
                "Задержка месячных",
                "Задержка полового созревания",
                "Задержка психического развития",
                "Задержка эякуляции",
                "Заикание",
                "Закрытый перелом",
                "Заноза",
                "Запор",
                "Затрудненные роды",
                "Затяжная пневмония",
                "Заусенцы",
                "Заячья губа",
                "Зернисто-клеточная карцинома",
                "Зигоматицит",
                "Зигомикоз",
                "Зоб",
                "ЗППП (ИППП) инфекции, передающиеся половым путем",
                "Зубной камень",
                "Зубной налет",
                "Зуд",
                "Игромания",
                "Иерсиниоз",
                "Изжога",
                "Импетиго",
                "Импотенция",
                "Инсулинома",
                "Инсульт",
                "Интернет-зависимость",
                "Инфаркт миокарда",
                "Инфекционный артрит",
                "Инфекционный мононуклеоз",
                "Ипохондрия",
                "Иридоциклит",
                "Искривление позвоночника",
                "Истинная экзема",
                "Ихтиоз",
                "Ишемическая болезнь сердца (ИБС)",
                "Ишемический инсульт",
                "Ишиас",
                "Й",
                "Йододефицит",
                "Кавернит",
                "Кандидоз кожи",
                "Кандидоз легких",
                "Карбункул",
                "Кардиомиопатия",
                "Кардиосклероз",
                "Кариес",
                "Картавость",
                "Катаракта",
                "Кахексия",
                "Кератит",
                "Кератоз",
                "Кератоконус",
                "Киста мениска",
                "Киста молочной железы",
                "Киста яичника",
                "Кифоз",
                "Кишечные колики",
                "Климакс",
                "Климактерический синдром",
                "Коклюш",
                "Коксартроз суставов",
                "Колит",
                "Колит ишемический",
                "Кома",
                "Кондиломы",
                "Контагиозный моллюск",
                "Контрактура Дюпюитрена",
                "Конъюнктивит",
                "Корь",
                "Косоглазие",
                "Косолапость",
                "Крапивница",
                "Краснуха",
                "Кривошея",
                "Купероз",
                "Лактостаз",
                "Ларингит",
                "Ларинготрахеит",
                "Легочная эмболия",
                "Легочное сердце",
                "Легочный фиброз",
                "Лейкемия",
                "Лейкоплакия (полости рта)",
                "Лейкоплакия шейки матки/наружных половых органов",
                "Лейциноз",
                "Лейшманиоз",
                "Лекарственная волчанка",
                "Лепра",
                "Лептоспироз",
                "Лимфаденит",
                "Лимфогранулематоз (венерический)",
                "Лимфома",
                "Лимфостаз",
                "Липодистрофия",
                "Липома",
                "Листериоз",
                "Лихорадка",
                "Лишай",
                "Лобковый педикулез",
                "Ложная беременность",
                "Ложный круп",
                "Лордоз",
                "Люмбаго",
                "Маловодие при беременности",
                "Малярия",
                "Маниакально-депрессивный психоз",
                "Мания величия",
                "Мания преследования",
                "Мастит",
                "Мастоидит",
                "Мастопатия",
                "Межпозвоночная грыжа",
                "Меланома",
                "Менингококковая инфекция (Менингит, Менингококкемия, менингеальный назофарингит, Менингоэнцефалия)",
                "Метеоризм",
                "Миалгия",
                "Мигрень",
                "Миелома",
                "Микоз",
                "Микоплазменная инфекция",
                "Микоплазмоз",
                "Микседема",
                "Милиарный туберкулез",
                "Миокардит",
                "Миома матки",
                "Митральный стеноз",
                "Молочница",
                "Мочекаменная болезнь",
                "Мышечная дистрофия",
                "Мышечный спазм",
                "Нарколепсия",
                "Нарушения менструального цикла",
                "Невенерический сифилис",
                "Невралгия",
                "Невралгия седалищного нерва",
                "Невралгия тройничного нерва",
                "Неврастения",
                "Неврит лицевого нерва",
                "Неврозы",
                "Невус пламенеющий",
                "Невынашивание беременности",
                "Недержание мочи",
                "Недержание мочи у женщин",
                "Недостаточность витамина А",
                "Нейродермит",
                "Нейросифилис",
                "Некротизирующий язвенный стоматит",
                "Непереносимость лактозы",
                "Нервная анорексия",
                "Нервная булимия",
                "Несахарный диабет",
                "Нефрит",
                "Нефроптоз",
                "Нистагм",
                "Ночная слепота",
                "Одышка",
                "Ожирение",
                "Ожог",
                "Окклюзия",
                "Ониходистрофия",
                "Онихомикоз",
                "Оофорит",
                "Опоясывающий лишай",
                "Опрелость",
                "Опущение и выпадение матки и влагалища",
                "Орнитоз",
                "Орхит",
                "Остеоартроз",
                "Остеомиелит",
                "Остеопороз",
                "Остеохондроз",
                "Острые респираторные заболевания (ОРЗ)",
                "Отек головного мозга",
                "Отек гортани",
                "Отек Квинке (ангионевротический отек)",
                "Отек легких",
                "Отит",
                "Отомикоз",
                "Отосклероз",
                "Отрубевидный лишай",
                "Отслоение сетчатки",
                "Отслойка сетчатки",
                "Панариций",
                "Панкреатит",
                "Параметрит",
                "Парапроктит",
                "Парапсориаз",
                "Паратонзиллярный абсцесс",
                "Парестезия",
                "Паркинсонизм",
                "Пародонтит",
                "Пародонтоз",
                "Педикулез",
                "Первичный иммунодефицит",
                "Перелом шейки бедра",
                "Перикардит",
                "Периодонтит",
                "Перитонит",
                "Перхоть",
                "Печеночная колика",
                "Пигментные пятна",
                "Пиелонефрит",
                "Пиодермия",
                "Плеврит",
                "Плечелопаточный периатроз",
                "Плоскостопие",
                "Пневмония (воспаление легких)",
                "Пневмосклероз",
                "Пневмоторакс",
                "Подагра",
                "Поликистоз яичников",
                "Полинейропатия",
                "Полиомиелит",
                "Полипы желудка",
                "Полипы шейки и тела матки",
                "Поллиноз",
                "Пороки сердца",
                "Порфирия",
                "Потница",
                "Почесуха (детская)",
                "Почечная колика (мочеточниковая колика)",
                "Проктит",
                "Простатит",
                "Псориаз",
                "Пульпит",
                "Пупочная грыжа",
                "Пяточная шпора",
                "Радикулит (радикулопатия)",
                "Разноцветный лишай",
                "Рак кожи",
                "Рак тела матки",
                "Рак шейки матки",
                "Рак яичников",
                "Рассеянный склероз",
                "Расстройства сексуального предпочтения",
                "Растяжки на коже",
                "Рахит",
                "Рвота",
                "Реактивный артрит",
                "Ревматизм",
                "Ревматоидный артрит",
                "Ректоцеле",
                "Ретинированные зубы",
                "Ретинопатия",
                "Рецессия десны",
                "Ринит атрофический",
                "Ринофима",
                "Родинки",
                "Рожа",
                "Розацеа",
                "Розовые угри",
                "Розовый лишай",
                "Ротавирусная инфекция",
                "Сальмонеллез",
                "Сальпингит",
                "Сап",
                "Саркоид Бека",
                "Саркоидоз",
                "Саркома Капоши",
                "Саркома Юинга",
                "Сахарный диабет",
                "Себорея",
                "Сепсис",
                "Сердечная астма",
                "Сикоз",
                "Синдром Дауна (болезнь Дауна, монголизм)",
                "Синдром дефицита внимания и гиперактивности",
                "Синдром Жильбера",
                "Синдром Марфана",
                "Синдром Патау",
                "Синдром раздраженного кишечника",
                "Синдром Рейно",
                "Синдром сухого глаза",
                "Синдром Туретта",
                "Синехия",
                "Синусит",
                "Сифилис",
                "Скарлатина",
                "Склеродермия",
                "Сколиоз",
                "Смещение позвонков",
                "Сосудистые звездочки (Телеангиоктазии)",
                "Сосудистые кризы",
                "Сотрясение мозга (коммоция)",
                "СПИД",
                "Спинальная мышечная атрофия",
                "Стеноз пищевода",
                "Стенокардия",
                "Столбняк",
                "Стоматит",
                "Стрептодермия",
                "Стригущий лишай",
                "Судороги",
                "Табачная зависимость",
                "Тахикардия",
                "Тендинит",
                "Тендовагинит",
                "Тепловой удар",
                "Тики у детей",
                "Тиреоидит",
                "Тирозинемия",
                "Тифлит",
                "Токсидермия",
                "Токсикоз беременных",
                "Токсоплазмоз",
                "Тонзиллит",
                "Трахеит",
                "Трахома",
                "Тревожное расстройство",
                "Тремор",
                "Трихомониаз",
                "Тромбоз вен",
                "Тромбофлебит",
                "Тромбоцитопения",
                "Тромбоэмболия",
                "Трофическая язва",
                "Туберкулез",
                "Тугоухость",
                "Туннельный синдром",
                "Увеит",
                "Угри",
                "Удаление миндалин",
                "Удушье",
                "Узкий таз",
                "Узловатая эритема",
                "Узловая мастопатия",
                "Укачивание",
                "Укус клеща",
                "Укусы животных",
                "Умственная отсталость",
                "Ураты в моче",
                "Уреаплазма",
                "Уреаплазмоз",
                "Уремия",
                "Уретероцеле",
                "Уретрит",
                "Урогенитальный кандидоз",
                "Уролитиаз",
                "Учащенное сердцебиение",
                "Ушиб",
                "Ущемление грыжи",
                "Ущемление нерва",
                "Фарингит",
                "Фенилкетонурия",
                "Феохромоцитома",
                "Фибрилляция предсердий",
                "Фиброаденома молочной железы",
                "Фиброз",
                "Фиброма",
                "Физиологическая желтуха",
                "Фимоз",
                "Флебит",
                "Флеботодермия",
                "Флегмона",
                "Флюороз",
                "Флюс",
                "Фобия",
                "Фолликулит",
                "Фотодерматоз",
                "Фригидность (гиполибидемия, анафродизия)",
                "Фронтит",
                "Функциональная диспепсия",
                "Фурункул",
                "Халязион",
                "Хейлит",
                "Хламидиоз",
                "Холангит",
                "Холера",
                "Холестериновые бляшки",
                "Холестероз желчного пузыря",
                "Холецистит",
                "Хондрома",
                "Хорея (пляска святого Вита, виттова пляска)",
                "Храп",
                "Хроническая ишемия головного мозга",
                "Хроническая обструктивная болезнь легких",
                "Хронический аппендицит",
                "Хронический лимфолейкоз",
                "Целиакия",
                "Целлюлит, воспаление",
                "Целлюлит, липодистрофия",
                "Цементома",
                "Центральная серозная ретинопатия",
                "Ценуроз",
                "Цервицит",
                "Церебральный атеросклероз",
                "Церебрастения",
                "Цереброваскулярная болезнь",
                "Церкариоз",
                "Циклотимия",
                "Цинга",
                "Цирроз печени",
                "Цистиноз",
                "Цистинурия",
                "Цистит",
                "Цистицеркоз",
                "Цитомегаловирусная инфекция",
                "Цитомегаловирусный ретинит",
                "Частичная адентия",
                "Часто болеющие дети",
                "Черепно-мозговая травма",
                "Черный акантоз",
                "Черный лишай",
                "Черный язык",
                "Чесотка",
                "Чирей",
                "Чрезмерно сильная родовая деятельность",
                "Чума",
                "Шанкроид",
                "Шепелявость",
                "Шигеллез",
                "Шистосомоз",
                "Шок",
                "Эбола",
                "Эзофагит",
                "Экзема",
                "Экзофтальм",
                "Эксгибиционизм",
                "Экстрасистолия",
                "Эластоз",
                "Эмфизема легких",
                "Эндокардит",
                "Эндометриоз матки (аденомиоз)",
                "Эндометриоз яичников",
                "Эндометрит",
                "Энтерит",
                "Энтеробиоз",
                "Энтеровирус",
                "Энурез",
                "Энцефалит",
                "Эпидемический паротит (свинка)",
                "Эпидермофития",
                "Эпидидимит",
                "Эпилепсия",
                "Эписклерит",
                "Эпителиома",
                "Эпифора",
                "Эритема",
                "Эритразма",
                "Эрозия шейки матки",
                "Эхинококкоз",
                "Эшерихиоз/Коли-инфекция",
                "Юношеские угри",
                "Ядерная желтуха",
                "Язва двенадцатиперстной кишки (язвенная болезнь двенадцатиперстной кишки)",
                "Язва желудка",
                "Язва роговицы",
                "Язвенный гингивит",
                "Язвенный неспецифический колит",
                "Ячмень",
                "Ящур"
            };

            for (int i = 0; i < counClient; i++)
            {
                numberName = random.Next(names.Count);
                numberSurname = random.Next(surnames.Count);
                numberDisease = random.Next(disease.Count);
                age=random.Next(minAge, maxAge);

                _clients.Add(new Client(names[numberName], surnames[numberSurname], age, disease[numberDisease]));
            }
        }

        public void Work()
        {
            bool isWork = true;

            while (isWork==true)
            {
                Console.WriteLine("  Medical Base \n\n  1 -  Sorting clients by Name\n  2 -  Sorting clients by Surname\n  3 -  Sorting clients by Age \n  4 -  Sorting clients by Disease \n  Any other button - Exite");

                switch (Console.ReadLine())
                {
                    case "1":
                        ShowClients(SortByName());
                        break;
                    case "2":
                        ShowClients(SortBySurname());
                        break;
                    case "3":
                        ShowClients(SortByAge());
                        break;
                    case "4":
                        ShowClients(SortByDisease());
                        break;
                    default:
                        isWork = false;
                        break;
                }
                Console.Clear();
            }
            
            Console.Clear();
        }

        private void ShowClients(List<Client> clients)
        {
            Console.Clear();

            if (clients != null & clients.Count > 0)
            {
                Console.WriteLine("\n List of eligible clients:");

                foreach (Client client in clients)
                {

                    Console.WriteLine($"\n  Name: {client.Name}   Surname: {client.Surname}  Age: {client.Age} Article: {client.Disease}");
                }
            }
            else
            {
                Console.WriteLine($"Client was not found");
            }

            Console.ReadLine();
        }

        private List<Client> SortByName()
        {            
            Console.Clear();
            Console.WriteLine("Please enter the client's name: ");
            string name = Console.ReadLine();

            var findClients = from Client client in _clients
                              where client.Name == name
                              select client;

            return findClients.ToList();
        }

        private List<Client> SortBySurname()
        {
            Console.Clear();
            Console.WriteLine("Please enter the client's surname: ");
            string surname = Console.ReadLine();

            var findClients = from Client client in _clients
                              where client.Surname == surname
                              select client;

            return findClients.ToList();
        }

        public List<Client> SortByAge()
        {
            Console.Clear();
            Console.WriteLine("Please enter the client's age: ");
            string age = Console.ReadLine();

            if (int.TryParse (age, out int clientAge))
            {               
                var findClients = from Client client in _clients
                                  where client.Age == clientAge
                                  select client;

                return findClients.ToList();
            }
            else
            {
                return null;
            }         
        }

        public List<Client> SortByDisease()
        {
            Console.Clear();
            Console.WriteLine("Please enter the client's disease: ");
            string disease = Console.ReadLine();

            var findClients = from Client client in _clients
                              where client.Disease.Contains(disease)
                              select client;

            return findClients.ToList();
        }
    }

    class Client
    {
        public string Name { get; private set; }
        public string Surname { get; private set; }
        public int Age { get; private set; }
        public string Disease { get; private set; }

        public Client(string name, string surname, int age, string disease)
        {
            Name = name;
            Surname = surname;
            Age = age;
            Disease = disease;
        }
    }
}
